<!DOCTYPE html>
<html lang="es">  
  <head>    
    <title>OVA - Prototipo</title>    
    <meta charset="UTF-8">
    <meta name="title" content="Estructura básica de HTML5">
    <meta name="description" content="Web para explicar estructura de HTML5, propiedades y elementos">     
  </head>  
  <body>    
    <header>
      <h1>Estructura b&aacute;sica de html5 (etiquetas, atributos y valores)</h1>      
    </header>    
    <section>      
      <article>
        <h2>Objetivo del sitio</h2>
        <p>El objetivo de esta propuesta de OVA es proporcionar a la UNAD de una herramienta din&aacute;mica para mejorar la estrategia de aprendizaje de los estudiantes</p>
        <div>
          <p>-Socializar a los estudiantes la estructura b&aacute;sica de un sitio web creado bajo HTML5.</p>
          <p>-Familiarizar a los estudiantes con las etiquetas usadas, los atributos y los valores de los mismos.</p>
          <p>-Animar a que los estudiantes realicen sus primeros sitios web brindando los conocimientos b&aacute;sicos necesarios para ello.</p>
        </div>
      </article>      
    </section>
    <section>
    <article>
        <h2>Materiales</h2>
        <p>Los contenidos de la secci&oacute;n serán tomados de los siguientes sitios:</p>
        <div>
          <a href="https://webdesdecero.com/tutorial-html5-la-sintaxis-y-la-estructura/">Web desde cero</a>
          <a href="https://vinkula.com/estructura-del-codigo-html5-anatomia-de-una-pagina-web/">Estructura del c&oacute;digo HTML5</a>
          <a href="https://www.arkaitzgarro.com/xhtml/capitulo-3.html">Etiquetas, atributos y elementos</a>
        </div>
        <p>Se utilizar&aacute;n im&aacute;genes de ejemplo que ser&aacute;n propiedad del creador de esta web, escribiendo pedazos de c&oacute;digo HTML5 y tomando capturas para su posterior visualizaci&oacute;n:</p>
        <p>El prototipo de p&aacute;gina principal ser&aacute; desarrollado con la aplicaci&aacute;n balsamiq</p>
        <div>
          <a href="https://balsamiq.com/products/mockups/">Balsamiq</a>
        </div>
      </article>      
    </section>
    <section>
    <article>
        <h2>Contenido</h2>
        <h3>Sintaxis HTML5</h3>
        <p> EL DOCTYPE: La primera l&iacute;nea de un documento corresponde a la DTD (Document Type Declaration) o declaraci&oacute;n de tipo de documento y sirve para indicar que versi&oacute;n de lenguaje HTML se ha usado al escribirlo.</p>
        <p> EL DOCUMENTO HTML: En una p&aacute;gina web, el elemento "html" indica el inicio del contenido HTML. En HTML s&oacute;lo necesitas indicar el lenguaje de la p&aacute;gina.</p>
        <p> LA CODIFICACI&Oacute;N DE LOS CARACTERES: Es frecuente indicar qu&eacute; codificaci&oacute;n de caracteres se ha usado en una p&aacute;gina web. Con HTML5 se simplifica con lo indispensable para que los navegadores puedan gestionarla correctamente.</p>
        <p> LA SINTAXIS DE LOS ELEMENTOS: Las comillas en HTML5 pasan a ser facultativas para los valores de los atributos. Puedes escribirlos con comillas dobles, comillas simples o sin ellas.</p>
        <h3>Elementos de HTML5</h3>
        <p> El nuevo elemento "header" se utiliza para definir una zona de visualizaci&oacute;n para las cabeceras. Puedes definir cabeceras tanto a nivel de p&aacute;gina como de una zona determinada (un art&iacute;culo, un men&uacute;, etc.)</p>
        <p> Del mismo modo, podr&aacute;s determinar un "footer" para toda la p&aacute;gina o utilizarlo en diferentes secciones de la web como por ejemplo un sidebar o un art&iacute;culo.</p>
        <p> El elemento "nav" sirve para definir una zona de navegaci&oacute;n con v&iacute;nculos. Lo que vendr&iacute;a a ser un men&uacute; de toda la vida. Este elemento esta pensado para la navegaci&oacute;n principal de la web y para definir v&iacute;nculos entre las diferentes p&aacute;ginas.</p>
        <p> La funci&oacute;n del elemento "section" es agrupar elementos relacionados entre s&iacute;. De este modo, podr&aacute;s por ejemplo, agrupar dentro de un mismo elemento un contenido con su t&iacute;tulo y su pie de p&aacute;gina.</p>
        <p> El "article" sirve para definir un contenido aut&oacute;nomo e independiente, que pueda ser usado en otra parte de la web sin que por ello pierda su significado.</p>
        <p> La funci&oacute;n del elemento "aside" es mostrar un contenido relacionado al contenido al cuál esta vinculado. Puede tratarse de sidebars, zonas de widgets, complementos sobre un art&iacute;culo, etc.</p>
        <h3>Etiquetas, atributos y elementos</h3>
        <p>HTML define un total de 91 etiquetas, de las cuales 10 se consideran obsoletas. Sin embargo, una etiqueta por s&iacute; sola a veces no contiene la suficiente informaci&oacute;n para estar completamente definida. Para ello contamos con los atributos: pares nombre-valor separados por "=" y escritos en la etiqueta inicial de un elemento despu&eacute;s del nombre del elemento. El valor puede estar encerrado entre "comillas dobles" o 'simples'. </p>
        <div>
          <p>Esta ser&iacute;a la estructura general de una l&iacute;nea de c&oacute;digo en lenguaje HTML:</p>
            <pre><tag attribute1="value1" attribute2="value2">content</tag></pre>
            <p>O lo que es lo mismo, con un ejemplo:</p>
            <pre><a href="http://www.enlace.com" target="_blank">Ejemplo de enlace</a></pre>
        </div>
      </article>      
    </section>
    <footer>
      <a href="index.html">Volver</a>
    </footer>
  </body>  
</html>